NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <string.h>

#include "access.h"
#include "access_config.h"
#include "access_status.h"
#include "event.h"

#include "config_messages.h"
#include "config_opcodes.h"
#include "config_server_events.h"
#include "config_server.h"
#include "composition_data.h"
#include "device_state_manager.h"
#include "packed_index_list.h"
#include "bearer_defines.h"

#include "flash_manager.h"
#include "net_state.h"
#include "net_beacon.h"
#include "nrf_mesh.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_keygen.h"
#include "mesh_opt_core.h"
#include "mesh_opt_gatt.h"
#include "nrf_mesh_events.h"
#include "nrf_mesh_utils.h"
#include "heartbeat.h"
#include "mesh_stack.h"

#if GATT_PROXY
#include "proxy.h"
#endif
/** Configuration server model ID. */
#define CONFIG_SERVER_MODEL_ID  0x0000

/*
 * Checks if the length of a packet is valid. This macro is used to check the sizes
 * of packets that have a config_model_id_t member, which means the packets can vary in
 * size by sizeof(uint16_t).
 */
#define IS_PACKET_LENGTH_VALID_WITH_ID(packet_type, p_packet) \
    ((p_packet)->length == sizeof(packet_type) || (p_packet)->length == sizeof(packet_type) - sizeof(uint16_t))

/**
 * Checks if the message is a SIG or vendor model message.
 * For some messages, both variants are possible, and the difference is determined by
 * checking the length of the message; SIG models contain a 16-bit model ID, while
 * vendor models contain a 32-bit model ID, making SIG messages 2 bytes shorter than
 * vendor messages.
 */
#define IS_SIG_MODEL(p_message, message_type) \
    ((p_message)->length == sizeof(message_type) - sizeof(uint16_t))

/**
 * Calculates the size of a packet depending on whether it is a SIG model or not.
 * See the description of IS_SIG_MODEL() for an explanation of the difference.
 */
#define PACKET_LENGTH_WITH_ID(packet_type, sig_model) \
    (sizeof(packet_type) - ((sig_model) ? sizeof(uint16_t) : 0))

#define KEY_REFRESH_TRANSITION_TO_PHASE_2      2
#define KEY_REFRESH_TRANSITION_TO_PHASE_3      3

typedef enum
{
    NODE_RESET_IDLE,
    NODE_RESET_PENDING,
#if GATT_PROXY
    NODE_RESET_PENDING_PROXY,
#endif /* GATT_PROXY */
    NODE_RESET_FLASHING,
} node_reset_state_t;

static access_model_handle_t m_config_server_handle = ACCESS_HANDLE_INVALID;
static config_server_evt_cb_t m_evt_cb;

/** Mesh event handler. */
static void mesh_event_cb(const nrf_mesh_evt_t * p_evt);
static nrf_mesh_evt_handler_t m_mesh_evt_handler = { .evt_cb = mesh_event_cb };

static nrf_mesh_tx_token_t m_reset_token;
static node_reset_state_t m_node_reset_pending = NODE_RESET_IDLE;

/********** Helper functions **********/

static inline void app_evt_send(const config_server_evt_t * p_evt)
{
    if (m_evt_cb)
    {
        m_evt_cb(p_evt);
    }
}

static bool model_id_extract(access_model_id_t * p_dest,
                             const config_model_id_t * p_id,
                             const access_message_rx_t * p_incoming,
                             uint16_t msg_size)
{
    bool sig_model = (p_incoming->length == ((msg_size) - sizeof(uint16_t)));

    if (sig_model)
    {
        p_dest->model_id = p_id->sig.model_id;
        p_dest->company_id = ACCESS_COMPANY_ID_NONE;
    }
    else
    {
        p_dest->model_id = p_id->vendor.model_id;
        p_dest->company_id = p_id->vendor.company_id;
    }

    return sig_model;
}

/*lint -ecall(569, send_reply) Conversion of size_t (returned by sizeof()) to uint16_t causes loss of precision. */
/*
 * Sends a message as a reply to an incoming message.
 */
static void send_reply(access_model_handle_t handle, const access_message_rx_t * p_message, uint16_t opcode,
        const uint8_t * p_reply, uint16_t reply_length, uint32_t tx_token)
{
    const access_message_tx_t reply =
    {
        .opcode =
        {
            .opcode = opcode,
            .company_id = ACCESS_COMPANY_ID_NONE
        },
        .p_buffer = p_reply,
        .length = reply_length,
        .access_token = (nrf_mesh_tx_token_t)tx_token,
        .force_segmented = false,
        .transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT
    };

    (void) access_model_reply(handle, p_message, &reply);
}

