NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
            send_reply(this_handle, p_incoming, CONFIG_OPCODE_VENDOR_MODEL_SUBSCRIPTION_LIST, (const uint8_t *) &response,
                       sizeof(config_msg_vendor_model_subscription_list_t), nrf_mesh_unique_token_get());
            break;
        }

    }
}

static access_status_t delete_all_subscriptions(access_model_handle_t model_handle)
{
    /* Get a list of all the models: */
    dsm_handle_t subscribed_addresses[ACCESS_SUBSCRIPTION_LIST_COUNT];
    uint16_t subscription_count = ACCESS_SUBSCRIPTION_LIST_COUNT;
    uint32_t status = access_model_subscriptions_get(model_handle, subscribed_addresses, &subscription_count);
    if (status == NRF_ERROR_NOT_SUPPORTED)
    {
        return ACCESS_STATUS_NOT_A_SUBSCRIBE_MODEL;
    }
    NRF_MESH_ASSERT(status == NRF_SUCCESS);

    for (uint16_t i = 0; i < subscription_count; ++i)
    {
        NRF_MESH_ASSERT(access_model_subscription_remove(model_handle, subscribed_addresses[i]) == NRF_SUCCESS);
        NRF_MESH_ASSERT(dsm_address_subscription_remove(subscribed_addresses[i]) == NRF_SUCCESS);
    }

    return ACCESS_STATUS_SUCCESS;
}

/* Sends the subscription status in response to subscription messages. */
static void send_subscription_status(access_model_handle_t this_handle, const access_message_rx_t * p_message,
        uint16_t element_address, uint16_t subscription_address, config_model_id_t model_id, bool sig_model)
{
    config_msg_subscription_status_t packet;

    packet.status = ACCESS_STATUS_SUCCESS;
    packet.element_address = element_address;
    packet.address = subscription_address;
    packet.model_id = model_id;

    send_reply(this_handle, p_message, CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, (const uint8_t *) &packet,
            PACKET_LENGTH_WITH_ID(config_msg_subscription_status_t, sig_model), nrf_mesh_unique_token_get());
}

static void send_netkey_status(access_model_handle_t handle,
                               const access_message_rx_t * p_message,
                               access_status_t status,
                               config_msg_key_index_12_t key_index)
{
    const config_msg_netkey_status_t response = {status, key_index};
    send_reply(handle, p_message, CONFIG_OPCODE_NETKEY_STATUS,
               (const uint8_t *) &response, sizeof(response), nrf_mesh_unique_token_get());
}

static uint16_t get_element_index(uint16_t element_address)
{
    dsm_local_unicast_address_t node_address;
    dsm_local_unicast_addresses_get(&node_address);

    if (element_address < node_address.address_start)
    {
        return ACCESS_ELEMENT_INDEX_INVALID;
    }

    uint16_t retval = element_address - node_address.address_start;
    if (retval >= (uint16_t) ACCESS_ELEMENT_COUNT)
    {
        return ACCESS_ELEMENT_INDEX_INVALID;
    }
    else
    {
        return retval;
    }
}

static inline access_status_t get_subscription_list(access_model_handle_t model_handle, uint16_t * p_sublist, uint16_t * p_subcount)
{
    uint32_t status = access_model_subscriptions_get(model_handle, p_sublist, p_subcount);
    switch (status)
    {
        case NRF_SUCCESS:
        {
            /* Resolve address handles to actual addresses */
            nrf_mesh_address_t addr;
            for (uint32_t i = 0; i < *p_subcount; i++)
            {
                if (dsm_address_get(*p_sublist, &addr) != NRF_SUCCESS)
                {
                    return ACCESS_STATUS_UNSPECIFIED_ERROR;
                }
                else
                {
                    if (addr.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL ||
                        addr.type == NRF_MESH_ADDRESS_TYPE_GROUP)
                    {
                        *(p_sublist++) = addr.value;
                    }
                    else
                    {
                        return ACCESS_STATUS_UNSPECIFIED_ERROR;
                    }
                }
            }
            return ACCESS_STATUS_SUCCESS;
        }
        case NRF_ERROR_NOT_SUPPORTED:
            return ACCESS_STATUS_NOT_A_SUBSCRIBE_MODEL;
        case NRF_ERROR_NOT_FOUND:
            return ACCESS_STATUS_INVALID_MODEL;
        default:
            return ACCESS_STATUS_UNSPECIFIED_ERROR;
    }
}

static uint32_t config_server_heartbeat_publication_params_get(heartbeat_publication_information_t * p_pub_info)
{

    heartbeat_publication_state_t * p_hb_pub = heartbeat_publication_get();
    const nrf_mesh_network_secmat_t *p_net_secmat = NULL;
    dsm_local_unicast_address_t node_address;
    dsm_local_unicast_addresses_get(&node_address);

    if (dsm_net_secmat_from_keyindex_get(p_hb_pub->netkey_index, &p_net_secmat) == NRF_SUCCESS)
    {
        p_pub_info->p_net_secmat  = p_net_secmat;
        p_pub_info->local_address = node_address.address_start;
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_NOT_FOUND;
    }
}

/********** Opcode handler functions **********/
static void handle_appkey_add(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_appkey_add_t))
    {
        return;
    }

    const config_msg_appkey_add_t * p_pdu = (const config_msg_appkey_add_t *) p_message->p_data;
    config_msg_key_index_24_t key_indexes = p_pdu->key_indexes;

    uint16_t netkey_index, appkey_index;
    config_msg_key_index_24_get(&key_indexes, &netkey_index, &appkey_index);

    uint32_t status;
    access_status_t status_code;
    config_server_evt_t evt;

    dsm_handle_t network_handle = dsm_net_key_index_to_subnet_handle(netkey_index);
    evt.type = CONFIG_SERVER_EVT_APPKEY_ADD;
    status = dsm_appkey_add(appkey_index, network_handle, p_pdu->appkey, &evt.params.appkey_add.appkey_handle);

    switch (status)
    {
        case NRF_SUCCESS:
            status_code = ACCESS_STATUS_SUCCESS;
            break;
        case NRF_ERROR_INTERNAL:
        {
            dsm_handle_t related_subnet;
            NRF_MESH_ERROR_CHECK(dsm_appkey_handle_to_subnet_handle(evt.params.appkey_add.appkey_handle,
                                                                    &related_subnet));
            status_code = related_subnet == network_handle ? ACCESS_STATUS_SUCCESS :
                                                             ACCESS_STATUS_INVALID_NETKEY;
            break;
        }
        case NRF_ERROR_INVALID_PARAM:
            status_code = ACCESS_STATUS_INVALID_APPKEY;
            break;
        case NRF_ERROR_FORBIDDEN:
            status_code = ACCESS_STATUS_KEY_INDEX_ALREADY_STORED;
            break;
        case NRF_ERROR_NO_MEM:
            status_code = ACCESS_STATUS_INSUFFICIENT_RESOURCES;
            break;
        case NRF_ERROR_NOT_FOUND:
            status_code = ACCESS_STATUS_INVALID_NETKEY;
            break;
        default:
            status_code = ACCESS_STATUS_UNSPECIFIED_ERROR;
            break;
    }

    send_appkey_status(handle, p_message, status_code, key_indexes);

    if (status == NRF_SUCCESS)
    {
        app_evt_send(&evt);
    }
}


static void handle_appkey_update(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_appkey_update_t))
    {
        return;
    }

    const config_msg_appkey_update_t * p_pdu = (const config_msg_appkey_update_t *) p_message->p_data;
    config_msg_key_index_24_t key_indexes = p_pdu->key_indexes;

