NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
    uint16_t netkey_index, appkey_index;
    config_msg_key_index_24_get(&key_indexes, &netkey_index, &appkey_index);

    access_status_t status_code = ACCESS_STATUS_SUCCESS;
    config_server_evt_t evt =
    {
        .type = CONFIG_SERVER_EVT_APPKEY_UPDATE
    };

    dsm_handle_t network_handle = dsm_net_key_index_to_subnet_handle(netkey_index);
    if (DSM_HANDLE_INVALID == network_handle)
    {
        status_code = ACCESS_STATUS_INVALID_NETKEY;
    }
    else
    {
        evt.params.appkey_update.appkey_handle = dsm_appkey_index_to_appkey_handle(appkey_index);
        if (DSM_HANDLE_INVALID == evt.params.appkey_update.appkey_handle)
        {
            status_code = ACCESS_STATUS_INVALID_APPKEY;
        }
    }

    if (ACCESS_STATUS_SUCCESS == status_code)
    {
        dsm_handle_t related_subnet;
        NRF_MESH_ERROR_CHECK(dsm_appkey_handle_to_subnet_handle(evt.params.appkey_update.appkey_handle,
                                                                &related_subnet));
        if (network_handle != related_subnet)
        {
            status_code = ACCESS_STATUS_INVALID_BINDING;
        }
    }

    if (ACCESS_STATUS_SUCCESS == status_code)
    {

        uint32_t status = dsm_appkey_update(evt.params.appkey_update.appkey_handle, p_pdu->appkey);

        switch (status)
        {
            case NRF_SUCCESS:
                break;
            case NRF_ERROR_INVALID_STATE:
                status_code = ACCESS_STATUS_CANNOT_UPDATE;
                break;
            case NRF_ERROR_NOT_FOUND:
                status_code = ACCESS_STATUS_INVALID_APPKEY;
                break;
            default:
                status_code = ACCESS_STATUS_UNSPECIFIED_ERROR;
                break;
        }
    }

    send_appkey_status(handle, p_message, status_code, key_indexes);

    if (ACCESS_STATUS_SUCCESS == status_code)
    {
        app_evt_send(&evt);
    }
}

static void handle_appkey_delete(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_appkey_delete_t))
    {
        return;
    }

    const config_msg_appkey_delete_t * p_pdu = (const config_msg_appkey_delete_t *) p_message->p_data;
    config_msg_key_index_24_t key_indexes = p_pdu->key_indexes;

    access_status_t status_code = ACCESS_STATUS_SUCCESS;
    uint16_t netkey_index, appkey_index;
    config_server_evt_t evt;
    evt.type = CONFIG_SERVER_EVT_APPKEY_DELETE;
    config_msg_key_index_24_get(&key_indexes, &netkey_index, &appkey_index);
    evt.params.appkey_delete.appkey_handle = dsm_appkey_index_to_appkey_handle(appkey_index);

    if (DSM_HANDLE_INVALID != evt.params.appkey_delete.appkey_handle)
    {
        dsm_handle_t network_handle = dsm_net_key_index_to_subnet_handle(netkey_index);
        if (DSM_HANDLE_INVALID == network_handle)
        {
            status_code = ACCESS_STATUS_INVALID_NETKEY;
        }

        if (ACCESS_STATUS_SUCCESS == status_code)
        {
            dsm_handle_t related_subnet;
            NRF_MESH_ERROR_CHECK(dsm_appkey_handle_to_subnet_handle(evt.params.appkey_delete.appkey_handle,
                                                                    &related_subnet));
            if (network_handle == related_subnet)
            {
                NRF_MESH_ERROR_CHECK(access_model_publication_by_appkey_stop(evt.params.appkey_delete.appkey_handle));
                NRF_MESH_ERROR_CHECK(dsm_appkey_delete(evt.params.appkey_delete.appkey_handle));
            }
            else
            {
                status_code = ACCESS_STATUS_INVALID_BINDING;
            }
        }
    }

    send_appkey_status(handle, p_message, status_code, key_indexes);

    if (ACCESS_STATUS_SUCCESS == status_code &&
        DSM_HANDLE_INVALID != evt.params.appkey_delete.appkey_handle)
    {
        app_evt_send(&evt);
    }
}

static void handle_appkey_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_appkey_get_t))
    {
        return;
    }

    const config_msg_appkey_get_t * p_pdu = (const config_msg_appkey_get_t *) p_message->p_data;
    uint16_t netkey_index = p_pdu->netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;

    mesh_key_index_t appkeys[DSM_APP_MAX];
    uint32_t appkey_count = DSM_APP_MAX;
    uint32_t status = dsm_appkey_get_all(dsm_net_key_index_to_subnet_handle(netkey_index),
        appkeys, &appkey_count);

    uint8_t packet_buffer[sizeof(config_msg_appkey_list_t) + PACKED_INDEX_LIST_SIZE(DSM_APP_MAX)];
    uint16_t reply_length = sizeof(config_msg_appkey_list_t);
    config_msg_appkey_list_t * p_reply = (config_msg_appkey_list_t *) packet_buffer;

    switch (status)
    {
        case NRF_SUCCESS:
            p_reply->status = ACCESS_STATUS_SUCCESS;
            p_reply->netkey_index = p_pdu->netkey_index;
            reply_length += PACKED_INDEX_LIST_SIZE(appkey_count);
            packed_index_list_create(appkeys, (uint8_t *) p_reply->packed_appkey_indexes, appkey_count);
            send_reply(handle, p_message, CONFIG_OPCODE_APPKEY_LIST, packet_buffer, reply_length, nrf_mesh_unique_token_get());
            break;
        case NRF_ERROR_NOT_FOUND:
            p_reply->status = ACCESS_STATUS_INVALID_NETKEY;
            p_reply->netkey_index = p_pdu->netkey_index;
            send_reply(handle, p_message, CONFIG_OPCODE_APPKEY_LIST, packet_buffer, reply_length, nrf_mesh_unique_token_get());
            break;
        default:
            send_generic_error_reply(handle, p_message, ACCESS_STATUS_UNSPECIFIED_ERROR, CONFIG_OPCODE_APPKEY_LIST,
                    sizeof(config_msg_appkey_list_t));
            break;
    }
}

static void handle_config_beacon_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_net_beacon_set_t))
    {
        return;
    }

    const config_msg_net_beacon_set_t * p_pdu = (const config_msg_net_beacon_set_t *) p_message->p_data;
    if (p_pdu->beacon_state == CONFIG_NET_BEACON_STATE_ENABLED ||
        p_pdu->beacon_state == CONFIG_NET_BEACON_STATE_DISABLED)
    {
        const config_server_evt_t evt = {
            .type = CONFIG_SERVER_EVT_BEACON_SET,
            .params.beacon_set.beacon_state = (p_pdu->beacon_state == CONFIG_NET_BEACON_STATE_ENABLED)
        };
        net_beacon_state_set(evt.params.beacon_set.beacon_state);
        send_net_beacon_state(handle, p_message);
        app_evt_send(&evt);
    }
}

