NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
static void handle_config_beacon_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length == 0)
    {
        send_net_beacon_state(handle, p_message);
    }
}

static void handle_composition_data_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_composition_data_get_t))
    {
        return;
    }

    const config_msg_composition_data_get_t * p_pdu = (const config_msg_composition_data_get_t *) p_message->p_data;
    if (p_pdu->page_number != 0 && p_pdu->page_number != 0xFF)
    {
        /* Only page 0/0xFF is supported in Mesh Profile Specification v1.0. */
        return;
    }

    uint8_t buffer[sizeof(config_msg_composition_data_status_t) + CONFIG_COMPOSITION_DATA_SIZE];
    config_msg_composition_data_status_t * p_response = (config_msg_composition_data_status_t *) buffer;
    p_response->page_number = 0;
    uint16_t size = CONFIG_COMPOSITION_DATA_SIZE;
    config_composition_data_get(p_response->data, &size);

    send_reply(handle, p_message, CONFIG_OPCODE_COMPOSITION_DATA_STATUS, buffer,
               sizeof(config_msg_composition_data_status_t) + size, nrf_mesh_unique_token_get());
}

static void handle_config_default_ttl_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != 0)
    {
        return;
    }

    uint8_t ttl = access_default_ttl_get();
    send_reply(handle, p_message, CONFIG_OPCODE_DEFAULT_TTL_STATUS, (const uint8_t *) &ttl, sizeof(ttl), nrf_mesh_unique_token_get());
}

static void handle_config_default_ttl_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_default_ttl_set_t * p_pdu = (const config_msg_default_ttl_set_t *) p_message->p_data;

    if (p_message->length != sizeof(config_msg_default_ttl_set_t))
    {
        return;
    }

    uint8_t ttl = p_pdu->ttl;
    if (access_default_ttl_set(ttl) == NRF_SUCCESS)
    {
        const config_server_evt_t evt = {.type = CONFIG_SERVER_EVT_DEFAULT_TTL_SET,
                                            .params.default_ttl_set.default_ttl = ttl};
        app_evt_send(&evt);

        send_reply(handle, p_message, CONFIG_OPCODE_DEFAULT_TTL_STATUS, (const uint8_t *) &ttl, sizeof(ttl), nrf_mesh_unique_token_get());
    }
}

static void handle_config_friend_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != 0)
    {
        return;
    }

    const config_msg_friend_status_t status_message = { .friend_state = CONFIG_FRIEND_STATE_UNSUPPORTED };
    send_reply(handle, p_message, CONFIG_OPCODE_FRIEND_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_config_friend_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_friend_set_t * p_pdu = (const config_msg_friend_set_t *) p_message->p_data;
    if (p_message->length != sizeof(config_msg_friend_set_t) ||
        p_pdu->friend_state >= CONFIG_FRIEND_STATE_UNSUPPORTED)
    {
        return;
    }

    const config_msg_friend_status_t status_message = { .friend_state = CONFIG_FRIEND_STATE_UNSUPPORTED };
    send_reply(handle, p_message, CONFIG_OPCODE_FRIEND_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_config_gatt_proxy_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != 0)
    {
        return;
    }

#if GATT_PROXY
    const config_msg_proxy_status_t status_message = {
        .proxy_state = (proxy_is_enabled() ? CONFIG_GATT_PROXY_STATE_RUNNING_ENABLED
                        : CONFIG_GATT_PROXY_STATE_RUNNING_DISABLED)};
#else
    const config_msg_proxy_status_t status_message = { .proxy_state = CONFIG_GATT_PROXY_STATE_UNSUPPORTED };
#endif

    send_reply(handle, p_message, CONFIG_OPCODE_GATT_PROXY_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_config_gatt_proxy_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_proxy_set_t * p_pdu = (const config_msg_proxy_set_t *) p_message->p_data;

    if (p_message->length != sizeof(config_msg_proxy_set_t) ||
        p_pdu->proxy_state >= CONFIG_GATT_PROXY_STATE_UNSUPPORTED)
    {
        return;
    }

#if GATT_PROXY
    bool enabled = p_pdu->proxy_state == CONFIG_GATT_PROXY_STATE_RUNNING_ENABLED;
    uint32_t err_code = mesh_opt_gatt_proxy_set(enabled);
    NRF_MESH_ASSERT_DEBUG(err_code == NRF_SUCCESS || err_code == NRF_ERROR_INVALID_STATE);

    (void) proxy_start();

    const config_msg_proxy_status_t status_message = {
        .proxy_state = (proxy_is_enabled() ? CONFIG_GATT_PROXY_STATE_RUNNING_ENABLED
                        : CONFIG_GATT_PROXY_STATE_RUNNING_DISABLED)};
#else
    const config_msg_proxy_status_t status_message = { .proxy_state = CONFIG_GATT_PROXY_STATE_UNSUPPORTED };
#endif

    send_reply(handle, p_message, CONFIG_OPCODE_GATT_PROXY_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_config_key_refresh_phase_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_key_refresh_phase_get_t))
    {
        return;
    }

    const config_msg_key_refresh_phase_get_t * p_pdu = (const config_msg_key_refresh_phase_get_t *) p_message->p_data;

    nrf_mesh_key_refresh_phase_t kr_phase;
    dsm_handle_t subnet_handle = dsm_net_key_index_to_subnet_handle(p_pdu->netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK);
    uint32_t status = dsm_subnet_kr_phase_get(subnet_handle, &kr_phase);
    config_msg_key_refresh_phase_status_t status_message = { .netkey_index = p_pdu->netkey_index };
    if (status == NRF_SUCCESS)
    {
        status_message.status = ACCESS_STATUS_SUCCESS;
        status_message.phase = (uint8_t) kr_phase;
    }
    else
    {
        status_message.status = ACCESS_STATUS_INVALID_NETKEY;
        status_message.phase = 0x00;
    }
    send_reply(handle, p_message, CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_config_key_refresh_phase_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_key_refresh_phase_set_t))
    {
        return;
    }

    const config_msg_key_refresh_phase_set_t * p_pdu = (const config_msg_key_refresh_phase_set_t *) p_message->p_data;
    config_msg_key_refresh_phase_status_t status_message =
    {
        .netkey_index = p_pdu->netkey_index,
        .phase = 0x00,
        .status = ACCESS_STATUS_INVALID_NETKEY, /* According to the specification, this is the only possible error status code for the KR state. */
    };

