NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
    /* Get the current key refresh phase: */
    nrf_mesh_key_refresh_phase_t current_kr_phase;
    dsm_handle_t subnet_handle = dsm_net_key_index_to_subnet_handle(p_pdu->netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK);
    uint32_t status = dsm_subnet_kr_phase_get(subnet_handle, &current_kr_phase);
    if (status == NRF_SUCCESS)
    {
        switch (p_pdu->transition)
        {
            case KEY_REFRESH_TRANSITION_TO_PHASE_2:
                if (current_kr_phase == NRF_MESH_KEY_REFRESH_PHASE_2 || current_kr_phase == NRF_MESH_KEY_REFRESH_PHASE_1)
                {
                    if (current_kr_phase == NRF_MESH_KEY_REFRESH_PHASE_1)
                    {
                        NRF_MESH_ERROR_CHECK(dsm_subnet_update_swap_keys(subnet_handle));
                    }
                    status_message.status = ACCESS_STATUS_SUCCESS;
                    status_message.phase = NRF_MESH_KEY_REFRESH_PHASE_2;
                    break;
                }
                return;
            case KEY_REFRESH_TRANSITION_TO_PHASE_3:
                if (current_kr_phase != NRF_MESH_KEY_REFRESH_PHASE_3)
                {
                    if (current_kr_phase != NRF_MESH_KEY_REFRESH_PHASE_0)
                    {
                        NRF_MESH_ERROR_CHECK(dsm_subnet_update_commit(subnet_handle));
                    }

                    status_message.status = ACCESS_STATUS_SUCCESS;
                    status_message.phase = NRF_MESH_KEY_REFRESH_PHASE_0;
                    break;
                }
                return;
            default:
                return;
        }
    }

    send_reply(handle, p_message, CONFIG_OPCODE_KEY_REFRESH_PHASE_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());

    if (status_message.status == ACCESS_STATUS_SUCCESS)
    {
        const config_server_evt_t evt = {
            .type = CONFIG_SERVER_EVT_KEY_REFRESH_PHASE_SET,
            .params.key_refresh_phase_set.kr_phase = (nrf_mesh_key_refresh_phase_t) status_message.phase
        };
        app_evt_send(&evt);
    }
}

static void handle_config_model_publication_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (!IS_PACKET_LENGTH_VALID_WITH_ID(config_msg_publication_get_t, p_message))
    {
        return;
    }

    const config_msg_publication_get_t * p_pdu = (const config_msg_publication_get_t *) p_message->p_data;

    /* Extract the model ID from the PDU: */
    access_model_id_t model_id;
    bool sig_model = model_id_extract(&model_id, &p_pdu->model_id, p_message, sizeof(config_msg_publication_get_t));

    /* Get element index from element address */
    uint16_t element_index = get_element_index(p_pdu->element_address);
    if (element_index == ACCESS_ELEMENT_INDEX_INVALID)
    {
        status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_ADDRESS);
        return;
    }

    /* Get the model handle: */
    access_model_handle_t model_handle;
    uint32_t status = access_handle_get(element_index, model_id, &model_handle);
    if (status != NRF_SUCCESS || (!sig_model && model_id.company_id == ACCESS_COMPANY_ID_NONE))
    {
        status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_MODEL);
    }
    else
    {
        send_publication_status(handle, p_message, p_pdu->element_address, model_handle);
    }
}

static void handle_config_model_publication_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (
            (p_message->opcode.opcode == CONFIG_OPCODE_MODEL_PUBLICATION_SET &&
                !IS_PACKET_LENGTH_VALID_WITH_ID(config_msg_publication_set_t, p_message))
            ||
            (p_message->opcode.opcode == CONFIG_OPCODE_MODEL_PUBLICATION_VIRTUAL_ADDRESS_SET &&
                !IS_PACKET_LENGTH_VALID_WITH_ID(config_msg_publication_virtual_set_t, p_message))
       )
    {
        return;
    }

    bool sig_model;
    access_model_id_t model_id;

    uint16_t element_address, publish_address = NRF_MESH_ADDR_UNASSIGNED;
    const config_publication_params_t * p_pubstate;

    /* Extract fields that are different (or placed at different offsets) based on the incoming opcode: */
    if (p_message->opcode.opcode == CONFIG_OPCODE_MODEL_PUBLICATION_SET)
    {
        const config_msg_publication_set_t * p_pdu = (const config_msg_publication_set_t *) p_message->p_data;
        sig_model = model_id_extract(&model_id, &p_pdu->state.model_id, p_message, sizeof(config_msg_publication_set_t));
        element_address = p_pdu->element_address;
        p_pubstate = &p_pdu->state;
        publish_address = p_pdu->publish_address;
    }
    else
    {
        const config_msg_publication_virtual_set_t * p_pdu = (const config_msg_publication_virtual_set_t *) p_message->p_data;
        sig_model = model_id_extract(&model_id, &p_pdu->state.model_id, p_message, sizeof(config_msg_publication_virtual_set_t));
        element_address = p_pdu->element_address;
        p_pubstate = &p_pdu->state;
    }

    uint16_t element_index = get_element_index(element_address);

    if (element_index == ACCESS_ELEMENT_INDEX_INVALID)
    {
        status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_ADDRESS);
        return;
    }

    /* Get the model handle: */
    access_model_handle_t model_handle;
    uint32_t status = access_handle_get(element_index, model_id, &model_handle);
    if (status != NRF_SUCCESS || (!sig_model && model_id.company_id == ACCESS_COMPANY_ID_NONE))
    {
        status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_MODEL);
        return;
    }

    /* Get the application key handle for the application key to publish on: */
    dsm_handle_t publish_appkey_handle = dsm_appkey_index_to_appkey_handle(p_pubstate->appkey_index);
    if (publish_appkey_handle == DSM_HANDLE_INVALID)
    {
        status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_APPKEY);
        return;
    }

