NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
    /* Validate and add the publish address to the DSM: */
    dsm_handle_t publish_address_handle = DSM_HANDLE_INVALID;
    nrf_mesh_address_t publish_address_stored;
    nrf_mesh_address_type_t publish_addr_type = nrf_mesh_address_type_get(publish_address);
    if (p_message->opcode.opcode == CONFIG_OPCODE_MODEL_PUBLICATION_SET)
    {
        if (publish_addr_type == NRF_MESH_ADDRESS_TYPE_VIRTUAL)
        {
            status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_ADDRESS);
            return;
        }
        else if (publish_addr_type == NRF_MESH_ADDRESS_TYPE_UNICAST || publish_addr_type == NRF_MESH_ADDRESS_TYPE_GROUP)
        {
            /* Check if given publish address is different than the currently assigned address */
            if (access_model_publish_address_get(model_handle, &publish_address_handle) != NRF_SUCCESS)
            {
                status = dsm_address_publish_add(publish_address, &publish_address_handle);
            }
            else
            {
                if (dsm_address_get(publish_address_handle, &publish_address_stored) == NRF_SUCCESS)
                {

                    if ((publish_address_stored.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL) ||
                        (publish_address_stored.type != NRF_MESH_ADDRESS_TYPE_VIRTUAL  &&
                         publish_address_stored.value != publish_address))
                    {
                        /* This should never assert */
                        NRF_MESH_ASSERT(dsm_address_publish_remove(publish_address_handle) == NRF_SUCCESS);
                        status = dsm_address_publish_add(publish_address, &publish_address_handle);
                    }
                    else
                    {
                        /* Use the retrieved publish_address_handle */
                    }
                }
                else
                {
                    status = dsm_address_publish_add(publish_address, &publish_address_handle);
                }
            }
        }
    }
    else
    {
        const uint8_t * publish_address_uuid = ((const config_msg_publication_virtual_set_t *) p_message->p_data)->publish_uuid;

        /* Check if given publish address is different than the currently assigned address */
        if (access_model_publish_address_get(model_handle, &publish_address_handle) != NRF_SUCCESS)
        {
            status = dsm_address_publish_virtual_add(publish_address_uuid, &publish_address_handle);
        }
        else
        {
            if (dsm_address_get(publish_address_handle, &publish_address_stored) == NRF_SUCCESS)
            {

                if ((publish_address_stored.type == NRF_MESH_ADDRESS_TYPE_VIRTUAL &&
                     memcmp(publish_address_stored.p_virtual_uuid, publish_address_uuid, NRF_MESH_UUID_SIZE) != 0) ||
                    (publish_address_stored.type != NRF_MESH_ADDRESS_TYPE_VIRTUAL))
                {
                    /* This should never assert */
                    NRF_MESH_ASSERT(dsm_address_publish_remove(publish_address_handle) == NRF_SUCCESS);
                    status = dsm_address_publish_virtual_add(publish_address_uuid, &publish_address_handle);
                }
                else
                {
                    /* Use the retrieved publish_address_handle */
                }
            }
            else
            {
                status = dsm_address_publish_virtual_add(publish_address_uuid, &publish_address_handle);
            }
        }
    }

    switch (status)
    {
        case NRF_ERROR_NO_MEM:
            status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_INSUFFICIENT_RESOURCES);
            return;

        case NRF_SUCCESS:
            break;

        default:
            status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_UNSPECIFIED_ERROR);
            return;
    }

    /* If publish address is unassigned for non virtual set, ignore all incoming parameters */
    if (publish_address != NRF_MESH_ADDR_UNASSIGNED || p_message->opcode.opcode == CONFIG_OPCODE_MODEL_PUBLICATION_VIRTUAL_ADDRESS_SET)
    {
        access_publish_period_t publish_period;
        access_publish_retransmit_t publish_retransmit;
        publish_period.step_res = p_pubstate->publish_period >> ACCESS_PUBLISH_STEP_NUM_BITS;
        publish_period.step_num = p_pubstate->publish_period & ~(0xff << ACCESS_PUBLISH_STEP_NUM_BITS);
        publish_retransmit.count = p_pubstate->retransmit_count;
        publish_retransmit.interval_steps = p_pubstate->retransmit_interval;


        /* Disable publishing for the model while updating the publication parameters: */
        status = access_model_publish_period_set(model_handle, ACCESS_PUBLISH_RESOLUTION_100MS, 0);
        switch (status)
        {
            case NRF_SUCCESS:
                break;

            case NRF_ERROR_NOT_SUPPORTED:
                /* Setting publish period when not supported, is an error */
                if (publish_period.step_num != 0)
                {
                    status_error_pub_send(handle, p_message, sig_model, ACCESS_STATUS_FEATURE_NOT_SUPPORTED);
                    return;
                }
                break;

            default:
                /* No other error should be possible. */
                NRF_MESH_ASSERT(false);
                return;
        }

        if (status == NRF_SUCCESS && publish_period.step_num != 0)
        {
            /* Set publishing parameters for the model: */
            NRF_MESH_ASSERT(access_model_publish_period_set(model_handle, (access_publish_resolution_t) publish_period.step_res,
                            publish_period.step_num) == NRF_SUCCESS);
        }

        NRF_MESH_ASSERT(access_model_publish_retransmit_set(model_handle, publish_retransmit) == NRF_SUCCESS);
        NRF_MESH_ASSERT(access_model_publish_address_set(model_handle, publish_address_handle) == NRF_SUCCESS);
        NRF_MESH_ASSERT(access_model_publish_application_set(model_handle, publish_appkey_handle) == NRF_SUCCESS);
        NRF_MESH_ASSERT(access_model_publish_ttl_set(model_handle, p_pubstate->publish_ttl) == NRF_SUCCESS);
    }
    else
    {
        NRF_MESH_ASSERT(access_model_publication_stop(model_handle) == NRF_SUCCESS);
    }

    access_flash_config_store();
    send_publication_status(handle, p_message, element_address, model_handle);

    const config_server_evt_t evt = {.type = CONFIG_SERVER_EVT_MODEL_PUBLICATION_SET,
                                     .params.model_publication_set.model_handle = model_handle};
    app_evt_send(&evt);
}

static void handle_config_model_subscription_add(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (!IS_PACKET_LENGTH_VALID_WITH_ID(config_msg_subscription_add_del_owr_t, p_message))
    {
        return;
    }

    const config_msg_subscription_add_del_owr_t * p_pdu = (const config_msg_subscription_add_del_owr_t *) p_message->p_data;

    /* Extract the model ID from the PDU: */
    access_model_id_t model_id;
    bool sig_model = model_id_extract(&model_id, &p_pdu->model_id, p_message, sizeof(config_msg_subscription_add_del_owr_t));

