NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
    status_message.relay_retransmit_count = relay.tx_count - 1;
    if ((relay.tx_interval_ms == BEARER_ADV_INT_MIN_MS) &&
        (status_message.relay_retransmit_count == 0))
    {
        status_message.relay_retransmit_interval_steps = 0;
    }
    else
    {
        status_message.relay_retransmit_interval_steps =
            CONFIG_RETRANSMIT_INTERVAL_MS_TO_STEP(relay.tx_interval_ms) - 1;
    }

    send_reply(handle, p_message, CONFIG_OPCODE_RELAY_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_config_relay_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != 0) /* Ignore messages with invalid length */
    {
        return;
    }

    send_relay_status(handle, p_message);
}

static void handle_config_relay_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_relay_set_t * p_pdu = (const config_msg_relay_set_t *) p_message->p_data;
    if (p_message->length != sizeof(config_msg_relay_set_t) ||
        p_pdu->relay_state >= CONFIG_RELAY_STATE_UNSUPPORTED)
    {
        return;
    }

    mesh_opt_core_adv_t relay_state;

    relay_state.enabled = (p_pdu->relay_state == CONFIG_RELAY_STATE_SUPPORTED_ENABLED);

    /**
     * According to Mesh Profile spec v1.0, sec. : "The Relay Retransmit Count + 1 is the number of times that
     * packet is transmitted for each packet that is relayed."
     */
    relay_state.tx_count = p_pdu->relay_retransmit_count + 1;

    if ((p_pdu->relay_retransmit_count == 0) && (p_pdu->relay_retransmit_interval_steps == 0))
    {
        /* No retransmits. Setting advertising interval to minimum to send first relay packet
         * (if any) as soon as possible */
        relay_state.tx_interval_ms = BEARER_ADV_INT_MIN_MS;
    }
    else
    {
        relay_state.tx_interval_ms = CONFIG_RETRANSMIT_INTERVAL_STEP_TO_MS(p_pdu->relay_retransmit_interval_steps + 1);
    }

    relay_state.tx_interval_ms = MAX(BEARER_ADV_INT_MIN_MS, relay_state.tx_interval_ms);
    NRF_MESH_ERROR_CHECK(mesh_opt_core_adv_set(CORE_TX_ROLE_RELAY,
                                               &relay_state));

    send_relay_status(handle, p_message);

    const config_server_evt_t evt = {
        .type = CONFIG_SERVER_EVT_RELAY_SET,
        .params.relay_set.enabled = (p_pdu->relay_state == CONFIG_RELAY_STATE_SUPPORTED_ENABLED),
        .params.relay_set.retransmit_count = p_pdu->relay_retransmit_count,
        .params.relay_set.interval_steps = p_pdu->relay_retransmit_interval_steps
    };
    app_evt_send(&evt);
}


static void send_network_transmit_status(access_model_handle_t handle, const access_message_rx_t * p_message)
{
    config_msg_network_transmit_status_t status_message = { 0 };

    mesh_opt_core_adv_t net;
    NRF_MESH_ERROR_CHECK(mesh_opt_core_adv_get(CORE_TX_ROLE_ORIGINATOR,
                                               &net));
    status_message.network_transmit_count = net.tx_count - 1;
    status_message.network_transmit_interval_steps =
        CONFIG_RETRANSMIT_INTERVAL_MS_TO_STEP(net.tx_interval_ms) - 1;

    send_reply(handle, p_message, CONFIG_OPCODE_NETWORK_TRANSMIT_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_config_network_transmit_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != 0) /* Ignore messages with invalid length */
    {
        return;
    }

    send_network_transmit_status(handle, p_message);
}


static void handle_config_network_transmit_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_network_transmit_set_t * p_pdu = (const config_msg_network_transmit_set_t *) p_message->p_data;
    if (p_message->length != sizeof(config_msg_network_transmit_set_t))
    {
        return;
    }

    mesh_opt_core_adv_t net;

    /* The main advertiser should always be enabled. */
    net.enabled = true;

    /**
     * According to Mesh Profile spec v1.0, sec. 4.2.19: "The number of transmissions is the
     * Transmit Count + 1."
     */
    net.tx_count = p_pdu->network_transmit_count + 1;
    net.tx_interval_ms = MAX(BEARER_ADV_INT_MIN_MS,
                             CONFIG_RETRANSMIT_INTERVAL_STEP_TO_MS(p_pdu->network_transmit_interval_steps + 1));
    NRF_MESH_ERROR_CHECK(mesh_opt_core_adv_set(CORE_TX_ROLE_ORIGINATOR, &net));

    send_network_transmit_status(handle, p_message);
    const config_server_evt_t evt = {
        .type = CONFIG_SERVER_EVT_NETWORK_TRANSMIT_SET,
        .params.network_transmit_set.retransmit_count = p_pdu->network_transmit_count,
        .params.network_transmit_set.interval_steps = p_pdu->network_transmit_interval_steps
    };
    app_evt_send(&evt);
}

static void handle_config_sig_model_subscription_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_model_subscription_get_t * p_pdu = (const config_msg_model_subscription_get_t *) p_message->p_data;
    if (p_message->length != PACKET_LENGTH_WITH_ID(config_msg_model_subscription_get_t, true))
    {
        return;
    }

    /* Get the model handle: */
    access_model_id_t model_id;
    bool sig_model = model_id_extract(&model_id, &p_pdu->model_id, p_message, sizeof(config_msg_model_subscription_get_t));

    /* Get the element index corresponding to the requested address: */
    uint16_t element_index = get_element_index(p_pdu->element_address);
    if (element_index == ACCESS_ELEMENT_INDEX_INVALID)
    {
        status_error_sub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_ADDRESS);
        return;
    }

    access_model_handle_t model_handle;
    uint32_t status = access_handle_get(element_index, model_id, &model_handle);
    if (status != NRF_SUCCESS)
    {
        status_error_sub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_MODEL);
        return;
    }

    uint16_t subscription_count = DSM_ADDR_MAX;
    uint16_t subscription_list[DSM_ADDR_MAX];
    access_status_t error_code = get_subscription_list(model_handle, subscription_list, &subscription_count);
    if (error_code != ACCESS_STATUS_SUCCESS)
    {
        status_error_sub_send(handle, p_message, sig_model, error_code);
        return;
    }

    uint8_t response_buffer[sizeof(config_msg_sig_model_subscription_list_t) + subscription_count * sizeof(uint16_t)];
    config_msg_sig_model_subscription_list_t * p_response = (config_msg_sig_model_subscription_list_t *) response_buffer;

    p_response->status = ACCESS_STATUS_SUCCESS;
    p_response->element_address = p_pdu->element_address;
    p_response->sig_model_id = model_id.model_id;
    memcpy((void *) p_response->subscriptions, subscription_list, subscription_count * sizeof(uint16_t));

    send_reply(handle, p_message, CONFIG_OPCODE_SIG_MODEL_SUBSCRIPTION_LIST, response_buffer,
            sizeof(config_msg_sig_model_subscription_list_t) + subscription_count * sizeof(uint16_t), nrf_mesh_unique_token_get());
}

static void handle_config_vendor_model_subscription_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_model_subscription_get_t * p_pdu = (const config_msg_model_subscription_get_t *) p_message->p_data;
    if (p_message->length != PACKET_LENGTH_WITH_ID(config_msg_model_subscription_get_t, false))
    {
        return;
    }

