NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
    /* Get the element index corresponding to the requested address: */
    uint16_t element_index = get_element_index(p_pdu->element_address);
    access_model_id_t model_id;
    access_model_handle_t model_handle;
    bool sig_model = model_id_extract(&model_id, &p_pdu->model_id, p_message, sizeof(config_msg_model_subscription_get_t));
    if (element_index == ACCESS_ELEMENT_INDEX_INVALID)
    {
        status_error_sub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_ADDRESS);
        return;
    }

    /* Get the model handle: */
    uint32_t status = access_handle_get(element_index, model_id, &model_handle);
    if (status != NRF_SUCCESS || (!sig_model && model_id.company_id == ACCESS_COMPANY_ID_NONE))
    {
        status_error_sub_send(handle, p_message, sig_model, ACCESS_STATUS_INVALID_MODEL);
        return;
    }

    uint16_t subscription_count = DSM_ADDR_MAX;
    uint16_t subscription_list[DSM_ADDR_MAX];
    access_status_t error_code = get_subscription_list(model_handle, subscription_list, &subscription_count);
    if (error_code != ACCESS_STATUS_SUCCESS)
    {
        status_error_sub_send(handle, p_message, sig_model, error_code);
        return;
    }

    const uint16_t subscription_list_size = subscription_count * sizeof(uint16_t);
    uint8_t response_buffer[sizeof(config_msg_vendor_model_subscription_list_t) + subscription_list_size];
    config_msg_vendor_model_subscription_list_t * p_response = (config_msg_vendor_model_subscription_list_t *) response_buffer;

    p_response->status = ACCESS_STATUS_SUCCESS;
    p_response->element_address = p_pdu->element_address;
    p_response->vendor_model_id = p_pdu->model_id.vendor.model_id;
    p_response->vendor_company_id = p_pdu->model_id.vendor.company_id;
    memcpy((void *) p_response->subscriptions, subscription_list, subscription_list_size);

    send_reply(handle, p_message, CONFIG_OPCODE_VENDOR_MODEL_SUBSCRIPTION_LIST, response_buffer,
            sizeof(config_msg_vendor_model_subscription_list_t) + subscription_list_size, nrf_mesh_unique_token_get());
}

static inline uint32_t heartbeat_publication_count_decode(uint8_t count_log)
{
    if (count_log == 0x00)
    {
        return 0x00;
    }
    else if (count_log <= HEARTBEAT_MAX_COUNT_LOG)
    {
        return (1 << (count_log - 1));
    }
    else if (count_log == HEARTBEAT_INF_COUNT_LOG)
    {
        return HEARTBEAT_INF_COUNT;
    }
    else
    {
        return HEARTBEAT_INVALID_COUNT;
    }
}

static inline uint32_t heartbeat_pubsub_period_decode(uint8_t period_log)
{
    if (period_log == 0x00)
    {
        return 0x00;
    }
    else if (period_log <= HEARTBEAT_MAX_PERIOD_LOG)
    {
        return (1 << (period_log - 1));
    }
    else
    {
        return HEARTBEAT_INVALID_PERIOD;
    }
}

static inline uint8_t heartbeat_pubsub_period_encode(uint32_t period)
{
    if (period == 0)
    {
        return 0x00;
    }
    else if (period <= HEARTBEAT_MAX_PERIOD)
    {
        return (log2_get(period) + 1);
    }
    else
    {
        NRF_MESH_ASSERT(false);
        return HEARTBEAT_MAX_PERIOD_LOG;
    }
}

static inline uint8_t heartbeat_publication_count_encode(uint32_t count)
{
    if (count <= 1)
    {
        return count;
    }
    else if (count <= HEARTBEAT_MAX_COUNT)
    {
        /* Finding smallest n where 2^(n-1) is greater than or equal to the count value */
        return (log2_get(count - 1) + 1 + 1);
    }
    else if (count == HEARTBEAT_INF_COUNT)
    {
        return HEARTBEAT_INF_COUNT_LOG;
    }
    else
    {
        NRF_MESH_ASSERT(false);
        return HEARTBEAT_MAX_COUNT_LOG;
    }
}

static inline uint8_t heartbeat_subscription_count_encode(uint32_t count)
{
    if (count == 0)
    {
        return 0x00;
    }
    else if (count <= HEARTBEAT_MAX_COUNT)
    {
        /* Finding largest n where 2^(n-1) is less than or equal to the count value */
        return (log2_get(count) + 1);
    }
    else if (count == HEARTBEAT_INF_COUNT)
    {
        return HEARTBEAT_INF_COUNT_LOG;
    }
    else
    {
        NRF_MESH_ASSERT(false);
        return HEARTBEAT_MAX_COUNT_LOG;
    }
}

static void handle_heartbeat_publication_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    config_msg_heartbeat_publication_status_t status_message;
    heartbeat_publication_state_t * p_hb_pub = heartbeat_publication_get();

    /* Ignore messages with invalid length */
    if (p_message->length != 0)
    {
        return;
    }

    status_message.status       = ACCESS_STATUS_SUCCESS;
    status_message.destination  = p_hb_pub->dst;

    /* As per Mesh Profile Specification v1.0, section 4.2.17.2 log(n) should be
    larger than or equal to n */
    status_message.count_log    = heartbeat_publication_count_encode(p_hb_pub->count);
    status_message.period_log   = heartbeat_pubsub_period_encode(p_hb_pub->period);
    status_message.ttl          = p_hb_pub->ttl;
    status_message.features     = p_hb_pub->features;
    status_message.netkey_index = p_hb_pub->netkey_index;

    send_reply(handle, p_message, CONFIG_OPCODE_HEARTBEAT_PUBLICATION_STATUS,
              (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_heartbeat_publication_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    config_msg_heartbeat_publication_status_t status_message;
    const config_msg_heartbeat_publication_set_t *p_pdu = (config_msg_heartbeat_publication_set_t *) p_message->p_data;
    heartbeat_publication_state_t * p_hb_pub = heartbeat_publication_get();

    if (p_message->length != sizeof(config_msg_heartbeat_publication_set_t))
    {
        return;
    }

    heartbeat_publication_state_t hb_pub = {
        .dst          = p_pdu->destination,
        .count        = heartbeat_publication_count_decode(p_pdu->count_log),
        .period       = heartbeat_pubsub_period_decode(p_pdu->period_log),
        .ttl          = p_pdu->ttl,
        .features     = p_pdu->features & HEARTBEAT_TRIGGER_TYPE_RFU_MASK,
        .netkey_index = p_pdu->netkey_index
    };

    /* This is specifically required for INVALID_NETKEY status code */
    if (dsm_net_key_index_to_subnet_handle(p_pdu->netkey_index) == DSM_HANDLE_INVALID)
    {
        status_message.status  = ACCESS_STATUS_INVALID_NETKEY;
    }
    else
    {
        if ((nrf_mesh_address_type_get(hb_pub.dst) == NRF_MESH_ADDRESS_TYPE_VIRTUAL) ||
            ((hb_pub.count > HEARTBEAT_MAX_COUNT) && (hb_pub.count < HEARTBEAT_INF_COUNT))  ||
            (hb_pub.period > HEARTBEAT_MAX_PERIOD) ||
            (hb_pub.ttl > NRF_MESH_TTL_MAX)
           )
        {
            status_message.status  = ACCESS_STATUS_CANNOT_SET;
        }
        else
        {
            p_hb_pub->dst = hb_pub.dst;

            if (p_hb_pub->dst == NRF_MESH_ADDR_UNASSIGNED)
            {
                p_hb_pub->count  = 0x0000;
                p_hb_pub->period = 0x0000;
                p_hb_pub->ttl    = 0x00;
            }
            else
            {
                // We want to set these values _even though_ we're not necessarily starting publication.
                // The user should expect to get these back when doing a
                // `CONFIG_OPCODE_HEARTBEAT_PUBLICATION_GET`.
                p_hb_pub->count  = hb_pub.count;
                p_hb_pub->period = hb_pub.period;
                p_hb_pub->ttl    = hb_pub.ttl;
            }

            p_hb_pub->features     = hb_pub.features & HEARTBEAT_TRIGGER_TYPE_RFU_MASK;
            p_hb_pub->netkey_index = hb_pub.netkey_index;

            heartbeat_publication_state_updated();

            status_message.status  = ACCESS_STATUS_SUCCESS;
        }
    }

    status_message.destination  =  p_pdu->destination;
    status_message.period_log   =  p_pdu->period_log;
    status_message.count_log    =  p_pdu->count_log;
    status_message.ttl          =  p_pdu->ttl;
    status_message.features     =  p_pdu->features & HEARTBEAT_TRIGGER_TYPE_RFU_MASK;
    status_message.netkey_index =  p_pdu->netkey_index;

    send_reply(handle, p_message, CONFIG_OPCODE_HEARTBEAT_PUBLICATION_STATUS,
              (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());

