NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
    if (response.status == ACCESS_STATUS_SUCCESS)
    {
        app_evt_send(&evt);
    }
}

static void handle_netkey_add_update(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_netkey_add_update_t * p_pdu = (const config_msg_netkey_add_update_t *) p_message->p_data;
    if (p_message->length != sizeof(config_msg_netkey_add_update_t))
    {
        return;
    }

    uint16_t netkey_index = p_pdu->netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;

    uint32_t status;
    dsm_handle_t network_handle;
    config_server_evt_t evt;
    if (p_message->opcode.opcode == CONFIG_OPCODE_NETKEY_ADD)
    {
        status = dsm_subnet_add(netkey_index, p_pdu->netkey, &network_handle);
        evt.type = CONFIG_SERVER_EVT_NETKEY_ADD;
        evt.params.netkey_add.netkey_handle = network_handle;
    }
    else
    {
        network_handle = dsm_net_key_index_to_subnet_handle(netkey_index);
        status = dsm_subnet_update(network_handle, p_pdu->netkey);
        evt.type = CONFIG_SERVER_EVT_NETKEY_UPDATE;
        evt.params.netkey_update.netkey_handle = network_handle;
    }

    access_status_t status_code;
    switch (status)
    {
        case NRF_SUCCESS:
        /* fall through */
        case NRF_ERROR_INTERNAL:
            status_code = ACCESS_STATUS_SUCCESS;
            break;
        case NRF_ERROR_INVALID_PARAM:
            status_code = ACCESS_STATUS_INVALID_NETKEY;
            break;
        case NRF_ERROR_FORBIDDEN:
            status_code = ACCESS_STATUS_KEY_INDEX_ALREADY_STORED;
            break;
        case NRF_ERROR_NO_MEM:
            status_code = ACCESS_STATUS_INSUFFICIENT_RESOURCES;
            break;
        case NRF_ERROR_NOT_FOUND:
            status_code = ACCESS_STATUS_INVALID_NETKEY;
            break;
        case NRF_ERROR_INVALID_STATE:
            status_code = ACCESS_STATUS_CANNOT_UPDATE;
            break;
        default:
            status_code = ACCESS_STATUS_UNSPECIFIED_ERROR;
            break;
    }

    send_netkey_status(handle, p_message, status_code, p_pdu->netkey_index);

    if (NRF_SUCCESS == status)
    {
        app_evt_send(&evt);
    }
}

static void handle_netkey_delete(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    const config_msg_netkey_delete_t * p_pdu = (const config_msg_netkey_delete_t *) p_message->p_data;
    config_msg_key_index_12_t netkey_index = p_pdu->netkey_index;

    if (p_message->length != sizeof(config_msg_netkey_delete_t))
    {
        return;
    }

    uint32_t status = NRF_SUCCESS;
    dsm_handle_t network_handle = dsm_net_key_index_to_subnet_handle(netkey_index & CONFIG_MSG_KEY_INDEX_12_MASK);

    if (network_handle == p_message->meta_data.subnet_handle)
    {
        status = NRF_ERROR_FORBIDDEN;
    }

    if (DSM_HANDLE_INVALID != network_handle && NRF_SUCCESS == status)
    {
        uint16_t appkey_instances[DSM_APP_MAX];
        uint32_t counter = DSM_APP_MAX;

        if (NRF_SUCCESS == dsm_appkey_get_all(network_handle, appkey_instances, &counter))
        {
            for (uint32_t i = 0; i < counter; i++)
            {
                appkey_instances[i] = dsm_appkey_index_to_appkey_handle(appkey_instances[i]);
            }
        }

        status = dsm_subnet_delete(network_handle);

        if (NRF_SUCCESS == status)
        {
            for (uint32_t i = 0; i < counter; i++)
            {
                NRF_MESH_ERROR_CHECK(access_model_publication_by_appkey_stop(appkey_instances[i]));
            }
        }
    }

    if (NRF_SUCCESS == status)
    {
        send_netkey_status(handle, p_message, ACCESS_STATUS_SUCCESS, netkey_index);
        const config_server_evt_t evt = {.type = CONFIG_SERVER_EVT_NETKEY_DELETE,
                                         .params.netkey_delete.netkey_handle = network_handle};
        app_evt_send(&evt);
    }
    else if (NRF_ERROR_FORBIDDEN == status)
    {
        send_netkey_status(handle, p_message, ACCESS_STATUS_CANNOT_REMOVE, netkey_index);
    }
    else
    {
        send_netkey_status(handle, p_message, ACCESS_STATUS_INVALID_NETKEY, netkey_index);
    }
}

static void handle_netkey_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != 0)
    {
        return;
    }

    uint32_t num_netkeys = DSM_SUBNET_MAX;
    mesh_key_index_t netkey_indexes[num_netkeys];
    (void) dsm_subnet_get_all(netkey_indexes, &num_netkeys);

    /* The 12-bit netkey indexes needs to be packed into an array before being sent to the client: */
    uint8_t buffer[PACKED_INDEX_LIST_SIZE(DSM_SUBNET_MAX)];
    uint16_t reply_length = PACKED_INDEX_LIST_SIZE(num_netkeys);
    packed_index_list_create(netkey_indexes, buffer, num_netkeys);

    send_reply(handle, p_message, CONFIG_OPCODE_NETKEY_LIST, buffer, reply_length, nrf_mesh_unique_token_get());
}

static void handle_node_identity_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_identity_get_t))
    {
        return;
    }

    const config_msg_identity_get_t * p_pdu = (const config_msg_identity_get_t *) p_message->p_data;

#if GATT_PROXY
    access_status_t access_status = ACCESS_STATUS_SUCCESS;
    const nrf_mesh_beacon_info_t * p_beacon_info = NULL;
    dsm_handle_t subnet = dsm_net_key_index_to_subnet_handle(p_pdu->netkey_index);
    if (dsm_beacon_info_get(subnet, &p_beacon_info) != NRF_SUCCESS)
    {
        access_status = ACCESS_STATUS_INVALID_NETKEY;
    }

    const config_msg_identity_status_t reply =
    {
        .status = access_status,
        .netkey_index = p_pdu->netkey_index,
        .identity_state = ((access_status == ACCESS_STATUS_SUCCESS && proxy_node_id_is_enabled(p_beacon_info))
                            ? CONFIG_IDENTITY_STATE_RUNNING
                            : CONFIG_IDENTITY_STATE_STOPPED)
    };
#else
    const config_msg_identity_status_t reply =
    {
        .status = ACCESS_STATUS_SUCCESS,
        .netkey_index = p_pdu->netkey_index,
        .identity_state = CONFIG_IDENTITY_STATE_UNSUPPORTED
    };
#endif

