NordicSemiconductor/nRF5-SDK-for-Mesh/models/foundation/config/src/config_server.c
    send_reply(handle, p_message, CONFIG_OPCODE_NODE_IDENTITY_STATUS,
               (const uint8_t *) &reply, sizeof(config_msg_identity_status_t), nrf_mesh_unique_token_get());
}

static void handle_node_identity_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (p_message->length != sizeof(config_msg_identity_set_t))
    {
        return;
    }

    const config_msg_identity_set_t * p_pdu = (const config_msg_identity_set_t *) p_message->p_data;

#if GATT_PROXY
    access_status_t access_status = ACCESS_STATUS_SUCCESS;
    const nrf_mesh_beacon_info_t * p_beacon_info = NULL;

    if (proxy_is_enabled())
    {
        if (p_pdu->identity_state == CONFIG_IDENTITY_STATE_RUNNING)
        {
            dsm_handle_t subnet = dsm_net_key_index_to_subnet_handle(p_pdu->netkey_index);
            nrf_mesh_key_refresh_phase_t kr_phase;
            if (dsm_beacon_info_get(subnet, &p_beacon_info) == NRF_SUCCESS &&
                dsm_subnet_kr_phase_get(subnet, &kr_phase)  == NRF_SUCCESS)
            {
                if (proxy_node_id_enable(p_beacon_info, kr_phase) != NRF_SUCCESS)
                {
                    access_status = ACCESS_STATUS_TEMPORARILY_UNABLE_TO_CHANGE_STATE;
                }
            }
            else
            {
                access_status = ACCESS_STATUS_INVALID_NETKEY;
            }
        }
        else if (p_pdu->identity_state == CONFIG_IDENTITY_STATE_STOPPED)
        {
            uint32_t err_code = proxy_node_id_disable();
            NRF_MESH_ASSERT_DEBUG(err_code == NRF_SUCCESS || NRF_ERROR_INVALID_STATE);
        }
        else
        {
            /* Invalid value */
            return;
        }
    }
    else
    {
        access_status = ACCESS_STATUS_TEMPORARILY_UNABLE_TO_CHANGE_STATE;
    }

    const config_msg_identity_status_t reply =
    {
        .status = access_status,
        .netkey_index = p_pdu->netkey_index,
        .identity_state = ((access_status == ACCESS_STATUS_SUCCESS &&
                            proxy_node_id_is_enabled(p_beacon_info))
                            ? CONFIG_IDENTITY_STATE_RUNNING
                            : CONFIG_IDENTITY_STATE_STOPPED)
    };
#else
    const config_msg_identity_status_t reply =
    {
        .status = ACCESS_STATUS_SUCCESS,
        .netkey_index = p_pdu->netkey_index,
        .identity_state = CONFIG_IDENTITY_STATE_UNSUPPORTED
    };
#endif

    send_reply(handle, p_message, CONFIG_OPCODE_NODE_IDENTITY_STATUS,
               (const uint8_t *) &reply, sizeof(config_msg_identity_status_t), nrf_mesh_unique_token_get());
}

static void handle_node_reset(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    /* Send reply, and then wait until reply has been clocked out of the radio (i.e. wait for the
     * TX_COMPLETE event) before clearing the state */
    m_reset_token = nrf_mesh_unique_token_get();
    m_node_reset_pending = NODE_RESET_PENDING;
    send_reply(handle, p_message, CONFIG_OPCODE_NODE_RESET_STATUS, NULL, 0, m_reset_token);
}

static uint8_t model_app_response_create(uint16_t opcode,
                                         uint8_t * p_buffer,
                                         access_status_t status,
                                         uint16_t element_address,
                                         access_model_id_t * p_model_id,
                                         mesh_key_index_t * p_appkey_list,
                                         uint16_t appkey_count)
{
    uint8_t size;

    if (opcode == CONFIG_OPCODE_SIG_MODEL_APP_GET)
    {
        config_msg_sig_model_app_list_t * p_response = (config_msg_sig_model_app_list_t *)p_buffer;
        p_response->status = status;
        p_response->element_address = element_address;
        p_response->sig_model_id = p_model_id->model_id;

        if (NULL != p_appkey_list)
        {
            packed_index_list_create(p_appkey_list, p_response->key_indexes, appkey_count);
        }

        size = sizeof(config_msg_sig_model_app_list_t);
    }
    else
    {
        config_msg_vendor_model_app_list_t * p_response = (config_msg_vendor_model_app_list_t *)p_buffer;
        p_response->status = status;
        p_response->element_address = element_address;
        p_response->vendor_company_id = p_model_id->company_id;
        p_response->vendor_model_id = p_model_id->model_id;

        if (NULL != p_appkey_list)
        {
            packed_index_list_create(p_appkey_list, p_response->key_indexes, appkey_count);
        }

        size = sizeof(config_msg_vendor_model_app_list_t);
    }

    return size + PACKED_INDEX_LIST_SIZE(appkey_count);
}

static void handle_model_app_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (!IS_PACKET_LENGTH_VALID_WITH_ID(config_msg_model_app_get_t, p_message))
    {
        return;
    }

    const config_msg_model_app_get_t * p_pdu = (const config_msg_model_app_get_t *) p_message->p_data;
    /* Get the model handle: */
    access_model_handle_t model_handle;
    access_model_id_t model_id;
    bool sig_model = model_id_extract(&model_id, &p_pdu->model_id, p_message, sizeof(config_msg_model_app_get_t));
    uint16_t element_index = get_element_index(p_pdu->element_address);
    uint16_t response_opcode = p_message->opcode.opcode == CONFIG_OPCODE_SIG_MODEL_APP_GET ?
            CONFIG_OPCODE_SIG_MODEL_APP_LIST : CONFIG_OPCODE_VENDOR_MODEL_APP_LIST;
    uint8_t response_buffer[sizeof(config_msg_vendor_model_app_list_t) + PACKED_INDEX_LIST_SIZE(DSM_APP_MAX)];

    if (ACCESS_ELEMENT_INDEX_INVALID == element_index)
    {
        uint8_t response_size = model_app_response_create(p_message->opcode.opcode,
                                                          response_buffer,
                                                          ACCESS_STATUS_INVALID_ADDRESS,
                                                          p_pdu->element_address,
                                                          &model_id,
                                                          NULL,
                                                          0);
        send_reply(handle, p_message, response_opcode, response_buffer, response_size, nrf_mesh_unique_token_get());
        return;
    }

    uint32_t status = access_handle_get(element_index, model_id, &model_handle);
    if (status != NRF_SUCCESS || (!sig_model && model_id.company_id == ACCESS_COMPANY_ID_NONE))
    {
        uint8_t response_size = model_app_response_create(p_message->opcode.opcode,
                                                          response_buffer,
                                                          ACCESS_STATUS_INVALID_MODEL,
                                                          p_pdu->element_address,
                                                          &model_id,
                                                          NULL,
                                                          0);
        send_reply(handle, p_message, response_opcode, response_buffer, response_size, nrf_mesh_unique_token_get());
        return;
    }

    /* Get the application list: */
    uint16_t appkey_instances[DSM_APP_MAX];
    uint16_t appkey_count = DSM_APP_MAX;
    NRF_MESH_ASSERT(access_model_applications_get(model_handle, appkey_instances, &appkey_count) == NRF_SUCCESS);

